In [10]:
import pandas as pd
import numpy as np
from pandas import Series

## lambda

In [2]:
# 덧셈
f = lambda x,y: x + y
f(1,4)

5

In [61]:
# 함수화
def f(x , y):
    return x + y

f(1,4)

5

In [65]:
# 제곱
(lambda x: x ** 2)(3)

9

## map & replace

In [5]:
ex = [1,2,3,4,5]
f = lambda x: x ** 2
list(map(f, ex))

[1, 4, 9, 16, 25]

In [14]:
s1 = Series(np.arange(10))
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [13]:
z = {1:'A', 2:'B', 3:'C'}
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

## 예제

In [75]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [76]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [77]:
# 성별 숫자형태로 변경
df["sex"] = df.sex.map({'male':0, 'female':1})
df

              earn  height  sex   race  ed  age
0     79571.299011   73.89    0  white  16   49
1     96396.988643   66.23    1  white  16   62
2     48710.666947   63.77    1  white  16   33
3     80478.096153   63.22    1  other  16   95
4     82089.345498   63.08    1  white  17   43
...            ...     ...  ...    ...  ..  ...
1374  30173.380363   71.68    0  white  12   33
1375  24853.519514   61.31    1  white  18   86
1376  13710.671312   63.64    1  white  12   37
1377  95426.014410   71.65    0  white  12   54
1378   9575.461857   68.22    0  white  12   31

[1379 rows x 6 columns]

In [45]:
# 변경 replace 사용
df.sex.replace({'male':0, 'female':1})

0       0
1       1
2       1
3       1
4       1
       ..
1374    0
1375    1
1376    1
1377    0
1378    0
Name: sex, Length: 1379, dtype: int64

In [46]:
df.sex.replace(['male','female'], 
              [0,1], inplace=True)
del df["sex_code"]
df

              earn  height  sex   race  ed  age
0     79571.299011   73.89    0  white  16   49
1     96396.988643   66.23    1  white  16   62
2     48710.666947   63.77    1  white  16   33
3     80478.096153   63.22    1  other  16   95
4     82089.345498   63.08    1  white  17   43
...            ...     ...  ...    ...  ..  ...
1374  30173.380363   71.68    0  white  12   33
1375  24853.519514   61.31    1  white  18   86
1376  13710.671312   63.64    1  white  12   37
1377  95426.014410   71.65    0  white  12   54
1378   9575.461857   68.22    0  white  12   31

[1379 rows x 6 columns]

## apply

시리즈 전체(컬럼)에 해당 함수를 적용

컬럼의 통계 자료를 낼 때 유용하게 사용할 수 있음

In [47]:
df_info = df[["earn", "height","age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [48]:
# 통계 ex1
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [50]:
# 통계 ex2
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [51]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [52]:
def f(x):
    return Series([x.min(), x.max(), x.mean()], 
                    index=["min", "max", "mean"])
df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499

In [53]:
# applymap : 전체에 적용
# ex) 전체 데이터프레임에 - 적용
f = lambda x : -x
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [54]:
# 위와 같음
f = lambda x : -x
df_info["earn"].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

## 기타 함수

In [55]:
# 전체 데이터이 요약 정보
df.describe()

                earn       height          sex           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640     0.622915    13.354605    45.328499
std     31257.070006     3.818108     0.484832     2.438741    15.789715
min       -98.580489    57.340000     0.000000     3.000000    22.000000
25%     10538.790721    63.720000     0.000000    12.000000    33.000000
50%     26877.870178    66.050000     1.000000    13.000000    42.000000
75%     44506.215336    69.315000     1.000000    15.000000    55.000000
max    317949.127955    77.210000     1.000000    18.000000    95.000000

In [56]:
# 유일한 값 unique()
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [60]:
# 카테고리형 데이터 몇 개 인지 모를때 라벨링하기 (dict)
res = np.array(dict(enumerate(df["race"].unique())))
res

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

In [59]:
# 두 개의 리스트로도 만들 수 있음
value = list(map(int, np.array(list(enumerate(df["race"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["race"].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])